<?php

namespace Database\Seeders;

use App\Models\User;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class SchoolUserSeed extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run()
    {
        $users = [

            ["id"=>"34111001","name"=>"بئر السبع الثانوية \"أ\" للبنين","phone"=>"599891226","department_id" => "25"],
            ["id"=>"34111003","name"=>"رفح الأساسية \"ب\" للبنين","phone"=>"599450833","department_id" => "25"],
            ["id"=>"34111008","name"=>"محمد يوسف النجار الأساسية المشتركة","phone"=>"599363816","department_id" => "25"],
            ["id"=>"34111009","name"=>"طه حسين الأساسية \"ب\"  للبنين","phone"=>"599188256","department_id" => "25"],
            ["id"=>"34111010","name"=>"طه حسين الأساسية \" أ \" للبنين","phone"=>"595257878","department_id" => "25"],
            ["id"=>"34111018","name"=>"رفح الأساسية \"أ\" للبنين","phone"=>"599864897","department_id" => "25"],
            ["id"=>"34111022","name"=>"عباس محمود العقاد الأساسية للبنات","phone"=>"599805392","department_id" => "25"],
            ["id"=>"34111023","name"=>"عباس محمود العقاد الثانوية للبنات","phone"=>"599866844","department_id" => "25"],
            ["id"=>"34111030","name"=>"آمنه بنت وهب الثانوية للبنات","phone"=>"599018076","department_id" => "25"],
            ["id"=>"34111031","name"=>"آمنة بنت وهب الأساسية للبنات","phone"=>"595577248","department_id" => "25"],
            ["id"=>"34111042","name"=>"دير ياسين الأساسية المشتركة","phone"=>"599299364","department_id" => "25"],
            ["id"=>"34111044","name"=>"شهداء رفح الثانوية للبنات","phone"=>"599331970","department_id" => "25"],
            ["id"=>"34111045","name"=>"القدس الثانوية للبنات","phone"=>"599263615","department_id" => "25"],
            ["id"=>"34111049","name"=>"نظير اللوقة الأساسية \"ب\" للبنات ","phone"=>"599318720","department_id" => "25"],
            ["id"=>"34111051","name"=>"نظير اللوقة الأساسية \" أ \" للبنات","phone"=>"569318720","department_id" => "25"],
            ["id"=>"34111053","name"=>"عقبة بن نافع الأساسية المشتركة","phone"=>"599893217","department_id" => "25"],
            ["id"=>"34111068","name"=>"رابعة العدوية الأساسية للبنين","phone"=>"599618824","department_id" => "25"],
            ["id"=>"34111069","name"=>"ثانوية الكويت للبنات","phone"=>"598278207","department_id" => "25"],
            ["id"=>"34111070","name"=>"رابعة العدوية الأساسية للبنات","phone"=>"599851319","department_id" => "25"],
            ["id"=>"34111071","name"=>"كمال عدوان الأساسية للبنين","phone"=>"594427600","department_id" => "25"],
            ["id"=>"34111072","name"=>"يبنا الأساسية \"أ\" للبنين","phone"=>"599166056","department_id" => "25"],
            ["id"=>"34111073","name"=>"يبنا الأساسية \"ب\" للبنين","phone"=>"599920846","department_id" => "25"],
            ["id"=>"34111074","name"=>"الدوحة الثانوية \"ب\" للبنين","phone"=>"592732088","department_id" => "25"],
            ["id"=>"34111075","name"=>"الدوحة الثانوية \"أ\" للبنين","phone"=>"599429863","department_id" => "25"],
            ["id"=>"34111076","name"=>"بئر السبع الثانوية \"ب\" للبنين","phone"=>"599305434","department_id" => "25"],
            ["id"=>"34111077","name"=>"شهداء رفح الأساسية للبنات","phone"=>"599688329","department_id" => "25"],
            ["id"=>"34111078","name"=>"مريم فرحات الثانوية للبنات","phone"=>"599881369","department_id" => "25"],
            ["id"=>"34111079","name"=>"فتحي الشقاقي الثانوية \" أ \" للبنين","phone"=>"595814418","department_id" => "25"],
            ["id"=>"34111080","name"=>"فتحي الشقاقي الثانوية \" ب \" للبنين","phone"=>"594254051","department_id" => "25"],
            ["id"=>"34111081","name"=>"مسقط رفح الثانوية \" أ \" للبنين","phone"=>"599724331","department_id" => "25"],
            ["id"=>"34111082","name"=>"مسقط رفح الثانوية \" ب \" للبنين","phone"=>"599893042","department_id" => "25"],
            ["id"=>"34111086","name"=>"القادسية الثانوية للبنات","phone"=>"599684898","department_id" => "25"],
            ["id"=>"34111089","name"=>"دير ياسين الأساسية للبنات","phone"=>"592013185","department_id" => "25"],
            ["id"=>"34112026","name"=>"غسان كنفاني الأساسية للبنين","phone"=>"599352530","department_id" => "25"],
            ["id"=>"34112052","name"=>"أحمد ياسين الثانوية للبنين","phone"=>"597297297","department_id" => "25"],
            ["id"=>"34112087","name"=>"مرمرة الأساسية للبنات","phone"=>"599174639","department_id" => "25"],
            ["id"=>"34112088","name"=>"الفردوس الأساسية للبنين","phone"=>"599953154","department_id" => "25"],
            ["id"=>"34112089","name"=>"المسمية الأساسية للبنات","phone"=>"598286521","department_id" => "25"],
            ["id"=>"34112090","name"=>"شفا عمرو الثانوية للبنات","phone"=>"595772591","department_id" => "25"],
            ["id"=>"34112091","name"=>"المسمية الأساسية للبنين","phone"=>"599536393","department_id" => "25"],
            ["id"=>"34112092","name"=>"الفردوس الأساسية للبنات","phone"=>"594260430","department_id" => "25"],
            ["id"=>"34112093","name"=>"شفا عمرو الأساسية للبنات","phone"=>"599280210","department_id" => "25"],
            ["id"=>"34112094","name"=>"أسرار القبندي الثانوية للبنات","phone"=>"599530380","department_id" => "25"],
            ["id"=>"34112095","name"=>"الشوكة الثانوية للبنات","phone"=>"599157170","department_id" => "25"],
            ["id"=>"34116601","name"=>"مركز محمد يوسف النجار للتعليم غير النظامي للذكور","phone"=>null,"department_id" => "25"],
            ["id"=>"34116602","name"=>"مركز القدس للتعليم غير النظامي للإناث","phone"=>null,"department_id" => "25"],
            ["id"=>"34118001","name"=>"مركز الدوحة لدراسات المنازل الذكور","phone"=>null,"department_id" => "25"],
            ["id"=>"34118002","name"=>"مركز شهداء رفح لدراسات المنازل الإناث","phone"=>null,"department_id" => "25"],
            ["id"=>"34119001","name"=>"مركز بئر السبع للدراسات المسائية للذكور","phone"=>null,"department_id" => "25"],
            ["id"=>"34119002","name"=>"مركز شهداء رفح للدراسات المسائية للإناث","phone"=>null,"department_id" => "25"],
            ["id"=>"34331701","name"=>"هيرمان جماينر SOS","phone"=>null,"department_id" => "25"],
            ["id"=>"34331702","name"=>"دار الفضيلة الخاصة المشتركة","phone"=>null,"department_id" => "25"],
            ["id"=>"34331703","name"=>"دار الفضيلة الخاصة ذكور","phone"=>null,"department_id" => "25"],
            ["id"=>"34341702","name"=>"طيبه للتربيه الخاصه","phone"=>null,"department_id" => "25"],
            ["id"=>"34341703","name"=>"الامل للصم","phone"=>null,"department_id" => "25"],
            ["id"=>"34343401","name"=>"الوحدة الارشادية - بنات","phone"=>null,"department_id" => "25"],
            ["id"=>"34343402","name"=>"الوحدة الارشادية - بنين","phone"=>null,"department_id" => "25"],
            ["id"=>"34343403","name"=>"وحدة النطق","phone"=>null,"department_id" => "25"],
            ["id"=>"34610001","name"=>"مركز طه حسين لمحو الأمية للذكور","phone"=>null,"department_id" => "25"],
            ["id"=>"34610002","name"=>"مركز آمنة بنت وهب  لمحو الأمية للإناث","phone"=>null,"department_id" => "25"],
            ["id"=>"34710001","name"=>"مركز القدس للتعليم الموازي للإناث","phone"=>null,"department_id" => "25"],
            ["id"=>"34710002","name"=>"محمد يوسف النجار - ذكور - للتعليم الموازي","phone"=>null,"department_id" => "25"],




            // Add the remaining user data here...
        ];

        foreach ($users as $user) {
            User::create([
                'id' => $user['id'],
                'name' => $user['name'],
                'password' => $user['id'],
                'phone' => $user['phone'],
                "role_id"=>4,
                'department_id' => $user['department_id'],
            ]);
        }
    }
}
