<?php
namespace Database\Seeders;
use Illuminate\Database\Seeder;
use App\Models\User;

class UserSeeder extends Seeder
{
    public function run()
    {
        $users = [
            [
                "id" => "800036253",
                "name" => "بهاء محمد موسى النحال",
                "password" => "159899",
                "phone" => "159899",
                "department_id" => "15"
            ],
            [
                "id"=> "900957028",
                "name"=> "أحمد عبد الله دياب لافي",
                "password"=> "38305",
                "phone"=> "9188590",
                "department_id"=> "1"
            ],
            [
                "id"=> "900331836",
                "name"=> "يحيى سعيد محمود جبر",
                "password"=> "44766",
                "phone"=> "567343104",
                "department_id"=> "12"
            ],
            [
                "id"=> "803880681",
                "name"=> "زياد سليمان رزق زعرب",
                "password"=> "232407",
                "phone"=> "567672110",
                "department_id"=> "12"
            ],
            [
                "id"=> "800169104",
                "name"=> "مجدي جمعه سلامه برهوم",
                "password"=> "206145",
                "phone"=> "567804515",
                "department_id"=> "12"
            ],
            [
                "id"=> "802420000",
                "name"=> "مروه حماده أحمد الهوبي",
                "password"=> "219189",
                "phone"=> "567862244",
                "department_id"=> "14"
            ],
            [
                "id"=> "956182869",
                "name"=> "سمير زكريا محمد الحوراني",
                "password"=> "16892",
                "phone"=> "592116088",
                "department_id"=> "1"
            ],
            [
                "id"=> "904051950",
                "name"=> "سليم محمد حسن النجيلي",
                "password"=> "219793",
                "phone"=> "592488138",
                "department_id"=> "15"
            ],
            [
                "id"=> "802310425",
                "name"=> "حسن صلاح أحمد مسمح",
                "password"=> "219411",
                "phone"=> "592520917",
                "department_id"=> "15"
            ],
            [
                "id"=> "925119265",
                "name"=> "خليل ابراهيم شعبان السقا",
                "password"=> "27003",
                "phone"=> "592731180",
                "department_id"=> "20"
            ],
            [
                "id"=> "900191461",
                "name"=> "باسم اسماعيل عبد القادر البدرساوي",
                "password"=> "27428",
                "phone"=> "592939138",
                "department_id"=> "18"
            ],
            [
                "id"=> "924058738",
                "name"=> "عاطف موسى محمد ابودان",
                "password"=> "219657",
                "phone"=> "594088978",
                "department_id"=> "8"
            ],
            [
                "id"=> "903114403",
                "name"=> "ياسر سيد ابراهيم ضهير",
                "password"=> "48550",
                "phone"=> "594107035",
                "department_id"=> "24"
            ],
            [
                "id"=> "404552754",
                "name"=> "نور زكي سليمان شلوف",
                "password"=> "0",
                "phone"=> "594697600",
                "department_id"=> "15"
            ],
            [
                "id"=> "926727298",
                "name"=> "باسم عبد الرحمن خليل المغاري",
                "password"=> "205501",
                "phone"=> "594726100",
                "department_id"=> "19"
            ],
            [
                "id"=> "936751494",
                "name"=> "نور الدين عبد العزيز حسين عابدين",
                "password"=> "205425",
                "phone"=> "595038794",
                "department_id"=> "4"
            ],
            [
                "id"=> "900144924",
                "name"=> "هاني شاكر محمود شقفه",
                "password"=> "211587",
                "phone"=> "595073131",
                "department_id"=> "15"
            ],
            [
                "id"=> "930613294",
                "name"=> "خالد محمد سليم النحال",
                "password"=> "45868",
                "phone"=> "595243606",
                "department_id"=> "15"
            ],
            [
                "id"=> "926729955",
                "name"=> "جهاد محمد خميس ابو حبيب",
                "password"=> "48602",
                "phone"=> "595279736",
                "department_id"=> "4"
            ],
            [
                "id"=> "800522484",
                "name"=> "منى فؤاد عبد العزيز العكر",
                "password"=> "219995",
                "phone"=> "595429086",
                "department_id"=> "15"
            ],
            [
                "id"=> "802718999",
                "name"=> "محمود نعيم أحمد الخطيب",
                "password"=> "228342",
                "phone"=> "595686624",
                "department_id"=> "20"
            ],
            [
                "id"=> "800681207",
                "name"=> "محمد عمر حسن مهنا",
                "password"=> "205449",
                "phone"=> "595875487",
                "department_id"=> "10"
            ],
            [
                "id"=> "900762659",
                "name"=> "ختام عبد الله سليمان المشوخي",
                "password"=> "25961",
                "phone"=> "595946392",
                "department_id"=> "6"
            ],
            [
                "id"=> "800409047",
                "name"=> "بدر محمد نهرو ابراهيم التليني",
                "password"=> "214393",
                "phone"=> "597066276",
                "department_id"=> "16"
            ],
            [
                "id"=> "803117183",
                "name"=> "افنان أحمد مصطفى ابووردة",
                "password"=> "224191",
                "phone"=> "597241838",
                "department_id"=> "17"
            ],
            [
                "id"=> "919510834",
                "name"=> "يحيى محمد عبد العال ابو العوف",
                "password"=> "27347",
                "phone"=> "597268230",
                "department_id"=> "19"
            ],
            [
                "id"=> "913268363",
                "name"=> "عبد الفتاح يوسف عبدالله طافش",
                "password"=> "219596",
                "phone"=> "597504064",
                "department_id"=> "8"
            ],
            [
                "id"=> "903449007",
                "name"=> "محمود عبد الله دياب لافي",
                "password"=> "16887",
                "phone"=> "597518532",
                "department_id"=> "19"
            ],
            [
                "id"=> "930354451",
                "name"=> "سهيله سيد ابراهيم ضهير",
                "password"=> "44890",
                "phone"=> "597524366",
                "department_id"=> "19"
            ],
            [
                "id"=> "800289464",
                "name"=> "عمار محمود حسن احمد",
                "password"=> "219960",
                "phone"=> "597551554",
                "department_id"=> "18"
            ],
            [
                "id"=> "901662247",
                "name"=> "فارس حماد محمد ابو جزر",
                "password"=> "214145",
                "phone"=> "597752522",
                "department_id"=> "9"
            ],
            [
                "id"=> "901341305",
                "name"=> "مثقال موسى أحمد عراده",
                "password"=> "219464",
                "phone"=> "597759568",
                "department_id"=> "6"
            ],
            [
                "id"=> "933782179",
                "name"=> "محمد ابراهيم حسين ابو عوده",
                "password"=> "201825",
                "phone"=> "597823871",
                "department_id"=> "14"
            ],
            [
                "id"=> "456601707",
                "name"=> "بسام احمد محمد ابو حجاج",
                "password"=> "219543",
                "phone"=> "598099076",
                "department_id"=> "16"
            ],
            [
                "id"=> "802024166",
                "name"=> "معاذ درويش محمد العرجا",
                "password"=> "219867",
                "phone"=> "598193692",
                "department_id"=> "15"
            ],
            [
                "id"=> "914311444",
                "name"=> "علي جابر حسين السميري",
                "password"=> "211622",
                "phone"=> "598265813",
                "department_id"=> "15"
            ],
            [
                "id"=> "928266261",
                "name"=> "بشرى محمد سليمان معمر",
                "password"=> "212918",
                "phone"=> "598274241",
                "department_id"=> "6"
            ],
            [
                "id"=> "410117774",
                "name"=> "ابراهيم أحمد حمدان قشطه",
                "password"=> "26392",
                "phone"=> "598284014",
                "department_id"=> "19"
            ],
            [
                "id"=> "932605041",
                "name"=> "سلامه عبد ربه سليم الخمايسة",
                "password"=> "167270",
                "phone"=> "598708147",
                "department_id"=> "15"
            ],
            [
                "id"=> "903777274",
                "name"=> "خميس حسن عبد الهادي ابو زيد",
                "password"=> "29130",
                "phone"=> "598999296",
                "department_id"=> "7"
            ],
            [
                "id"=> "802599654",
                "name"=> "محمد زايد سلامه ابو شوشه",
                "password"=> "220562",
                "phone"=> "599018712",
                "department_id"=> "15"
            ],
            [
                "id"=> "961115615",
                "name"=> "حنان موسى العبد عبد الجواد",
                "password"=> "25841",
                "phone"=> "599019499",
                "department_id"=> "19"
            ],
            [
                "id"=> "412312308",
                "name"=> "محمود جهاد محمد قفة",
                "password"=> "215482",
                "phone"=> "599020626",
                "department_id"=> "3"
            ],
            [
                "id"=> "801380379",
                "name"=> "اسماعيل محمد أحمد النجار",
                "password"=> "214400",
                "phone"=> "599043567",
                "department_id"=> "13"
            ],
            [
                "id"=> "931707699",
                "name"=> "اسامه ابراهيم محمود ابو حطب",
                "password"=> "219214",
                "phone"=> "599158993",
                "department_id"=> "22"
            ],
            [
                "id"=> "927396820",
                "name"=> "أيمن سليم محمد الحاج احمد",
                "password"=> "211434",
                "phone"=> "599169211",
                "department_id"=> "15"
            ],
            [
                "id"=> "800290850",
                "name"=> "سلوى عارف عبد ربه ابو صبيح",
                "password"=> "208797",
                "phone"=> "599176155",
                "department_id"=> "19"
            ],
            [
                "id"=> "938487253",
                "name"=> "سمية عبد الرحمن راجح الغوطي",
                "password"=> "212680",
                "phone"=> "599184671",
                "department_id"=> "8"
            ],
            [
                "id"=> "931566483",
                "name"=> "انس محمد سلمان ابو صوصين",
                "password"=> "219288",
                "phone"=> "599194050",
                "department_id"=> "15"
            ],
            [
                "id"=> "936750587",
                "name"=> "جهاد محمد احمد عدوان",
                "password"=> "27352",
                "phone"=> "599222523",
                "department_id"=> "19"
            ],
            [
                "id"=> "900653668",
                "name"=> "فدوى محمد سليمان المشوخي",
                "password"=> "44868",
                "phone"=> "599243965",
                "department_id"=> "19"
            ],
            [
                "id"=> "800287773",
                "name"=> "ايمان صالح محمد الترابين",
                "password"=> "204139",
                "phone"=> "599262732",
                "department_id"=> "8"
            ],
            [
                "id"=> "915317267",
                "name"=> "نزيه حسن حسين يونس",
                "password"=> "27341",
                "phone"=> "599305468",
                "department_id"=> "19"
            ],
            [
                "id"=> "800789133",
                "name"=> "خالد محمد علي ابو جزر",
                "password"=> "217861",
                "phone"=> "599318732",
                "department_id"=> "7"
            ],
            [
                "id"=> "901260679",
                "name"=> "عادل فايز محمد ابو كوش",
                "password"=> "221133",
                "phone"=> "599323581",
                "department_id"=> "5"
            ],
            [
                "id"=> "928825470",
                "name"=> "يحيى مصطفى محمد طباسي",
                "password"=> "219870",
                "phone"=> "599326011",
                "department_id"=> "14"
            ],
            [
                "id"=> "907291843",
                "name"=> "عبد الناصر لطفي خميس الجزار",
                "password"=> "13757",
                "phone"=> "599329359",
                "department_id"=> "19"
            ],
            [
                "id"=> "923261358",
                "name"=> "اسماعيل ابراهيم احمد حرب",
                "password"=> "18840",
                "phone"=> "599334608",
                "department_id"=> "1"
            ],
            [
                "id"=> "900293127",
                "name"=> "سامي خليل ابراهيم فحجان",
                "password"=> "201679",
                "phone"=> "599342135",
                "department_id"=> "20"
            ],
            [
                "id"=> "905229498",
                "name"=> "شحده عبد الله شحده محسن",
                "password"=> "48267",
                "phone"=> "599346196",
                "department_id"=> "6"
            ],
            [
                "id"=> "413393851",
                "name"=> "ايمن درويش محمود حرابي",
                "password"=> "26302",
                "phone"=> "599346923",
                "department_id"=> "12"
            ],
            [
                "id"=> "924316805",
                "name"=> "خديجه محمد حسن المينراوي",
                "password"=> "12858",
                "phone"=> "599347394",
                "department_id"=> "17"
            ],
            [
                "id"=> "932071020",
                "name"=> "محمود لطفي خميس الجزار",
                "password"=> "48688",
                "phone"=> "599348174",
                "department_id"=> "19"
            ],
            [
                "id"=> "900553595",
                "name"=> "اسماعيل ابراهيم محمد العرجا",
                "password"=> "204170",
                "phone"=> "599354922",
                "department_id"=> "18"
            ],
            [
                "id"=> "900803248",
                "name"=> "عامر أحمد سعيد ابو طه",
                "password"=> "21743",
                "phone"=> "599423077",
                "department_id"=> "17"
            ],
            [
                "id"=> "900257742",
                "name"=> "نجاة علي أحمد بارود",
                "password"=> "25921",
                "phone"=> "599423323",
                "department_id"=> "19"
            ],
            [
                "id"=> "801281437",
                "name"=> "اسماء أحمد حمدان ضهير",
                "password"=> "216856",
                "phone"=> "599459184",
                "department_id"=> "17"
            ],
            [
                "id"=> "923871438",
                "name"=> "أحمد سالم رزق الجعفري",
                "password"=> "212018",
                "phone"=> "599498547",
                "department_id"=> "1"
            ],
            [
                "id"=> "992690669",
                "name"=> "ياسر سليمان عبد الرحمن المدلل",
                "password"=> "12754",
                "phone"=> "599498560",
                "department_id"=> "15"
            ],
            [
                "id"=> "800907461",
                "name"=> "أحمد صلاح محمد بريكه",
                "password"=> "166753",
                "phone"=> "599499319",
                "department_id"=> "6"
            ],
            [
                "id"=> "801028523",
                "name"=> "عبير سعيد مصطفى الكرنز",
                "password"=> "217896",
                "phone"=> "599502913",
                "department_id"=> "11"
            ],
            [
                "id"=> "974487621",
                "name"=> "اسعد عبد الرحمن محمد عواد",
                "password"=> "46181",
                "phone"=> "599565610",
                "department_id"=> "19"
            ],
            [
                "id"=> "900996778",
                "name"=> "محي الدين محمد سليمان ابو سنيمه",
                "password"=> "205996",
                "phone"=> "599570613",
                "department_id"=> "15"
            ],
            [
                "id"=> "905284071",
                "name"=> "فاتن محمد ابراهيم الحولي",
                "password"=> "157401",
                "phone"=> "599573866",
                "department_id"=> "21"
            ],
            [
                "id"=> "906711288",
                "name"=> "تغريد أحمد حسين جاد الله",
                "password"=> "204819",
                "phone"=> "599574116",
                "department_id"=> "8"
            ],
            [
                "id"=> "935052258",
                "name"=> "محمد عبد الحميد حسين عيسى",
                "password"=> "205682",
                "phone"=> "599603266",
                "department_id"=> "23"
            ],
            [
                "id"=> "993238336",
                "name"=> "نظام نعيم محمد سلامة",
                "password"=> "38228",
                "phone"=> "599618189",
                "department_id"=> "18"
            ],
            [
                "id"=> "924883234",
                "name"=> "نجاح عبد الهادي مسلم البهنساوي",
                "password"=> "16269",
                "phone"=> "599621455",
                "department_id"=> "19"
            ],
            [
                "id"=> "801528936",
                "name"=> "أسعد يوسف أحمد ابو نجا",
                "password"=> "220568",
                "phone"=> "599621552",
                "department_id"=> "15"
            ],
            [
                "id"=> "900182502",
                "name"=> "ياسر محمد محمد اسليم",
                "password"=> "42271",
                "phone"=> "599626645",
                "department_id"=> "19"
            ],
            [
                "id"=> "956197750",
                "name"=> "امين موسى حسين شعت",
                "password"=> "21851",
                "phone"=> "599639522",
                "department_id"=> "19"
            ],
            [
                "id"=> "955838156",
                "name"=> "سلامه حمدان عبدالله الدباري",
                "password"=> "18652",
                "phone"=> "599668935",
                "department_id"=> "3"
            ],
            [
                "id"=> "913255493",
                "name"=> "ساميه حسن عبد الرحمن ابو شرقيه",
                "password"=> "21917",
                "phone"=> "599683250",
                "department_id"=> "15"
            ],
            [
                "id"=> "907391916",
                "name"=> "سامي محمد ابراهيم جودة",
                "password"=> "217203",
                "phone"=> "599683383",
                "department_id"=> "15"
            ],
            [
                "id"=> "930535968",
                "name"=> "زكري عبد المجيد محمد كلاب",
                "password"=> "203997",
                "phone"=> "599689068",
                "department_id"=> "3"
            ],
            [
                "id"=> "913945606",
                "name"=> "آمنة خميس عطية عياش",
                "password"=> "19117",
                "phone"=> "599724368",
                "department_id"=> "12"
            ],
            [
                "id"=> "972436158",
                "name"=> "سهيل أحمد عبدالله مسلم",
                "password"=> "21617",
                "phone"=> "599728994",
                "department_id"=> "19"
            ],
            [
                "id"=> "931559025",
                "name"=> "أحمد سميح مصطفى حماد",
                "password"=> "203189",
                "phone"=> "599742821",
                "department_id"=> "11"
            ],
            [
                "id"=> "901262881",
                "name"=> "علاء حسن عبد الرحمن حسون",
                "password"=> "47003",
                "phone"=> "599745165",
                "department_id"=> "7"
            ],
            [
                "id"=> "905283149",
                "name"=> "محمد عبد الحليم عبد الله عيسى",
                "password"=> "213483",
                "phone"=> "599768747",
                "department_id"=> "16"
            ],
            [
                "id"=> "900676628",
                "name"=> "عبد الباسط عبد الله زايد المصري",
                "password"=> "41878",
                "phone"=> "599770137",
                "department_id"=> "19"
            ],
            [
                "id"=> "946671740",
                "name"=> "عمار وليد عبد السلام الشريف",
                "password"=> "166632",
                "phone"=> "599792598",
                "department_id"=> "13"
            ],
            [
                "id"=> "914361175",
                "name"=> "مريم أحمد سليمان ابو جزر",
                "password"=> "13689",
                "phone"=> "599804528",
                "department_id"=> "19"
            ],
            [
                "id"=> "801822669",
                "name"=> "محمد ابراهيم علي الجديلي",
                "password"=> "216197",
                "phone"=> "599811682",
                "department_id"=> "19"
            ],
            [
                "id"=> "906546338",
                "name"=> "رامي توفيق سليم المصري",
                "password"=> "216838",
                "phone"=> "599832592",
                "department_id"=> "12"
            ],
            [
                "id"=> "962515755",
                "name"=> "محمد عبد المجيد محمد ابو شقير",
                "password"=> "175223",
                "phone"=> "599841334",
                "department_id"=> "2"
            ],
            [
                "id"=> "901366153",
                "name"=> "زهير بهاء الدين حسين ابو خاطر",
                "password"=> "40542",
                "phone"=> "599849050",
                "department_id"=> "11"
            ],
            [
                "id"=> "800274656",
                "name"=> "محمد جمال محمد صبح",
                "password"=> "219554",
                "phone"=> "599867032",
                "department_id"=> "15"
            ],
            [
                "id"=> "900501321",
                "name"=> "علاء الدين مصطفى خميس صيدم",
                "password"=> "201756",
                "phone"=> "599891257",
                "department_id"=> "20"
            ],
            [
                "id"=> "909708166",
                "name"=> "سليم عبد الله سليمان الحولي",
                "password"=> "13505",
                "phone"=> "599893055",
                "department_id"=> "15"
            ],
            [
                "id"=> "961139888",
                "name"=> "اياد عبد المالك محمد كلاب",
                "password"=> "219282",
                "phone"=> "599904726",
                "department_id"=> "16"
            ],
            [
                "id"=> "913825949",
                "name"=> "مجدي ابراهيم محمود صيام",
                "password"=> "219504",
                "phone"=> "599908874",
                "department_id"=> "15"
            ],
            [
                "id"=> "910329499",
                "name"=> "يوسف عبد الكريم صالح أبو الروس",
                "password"=> "26635",
                "phone"=> "599913765",
                "department_id"=> "2"
            ],
            [
                "id"=> "923989933",
                "name"=> "أحمد غازي محمد شعت",
                "password"=> "219361",
                "phone"=> "599922567",
                "department_id"=> "4"
            ],
            [
                "id"=> "900952045",
                "name"=> "رقيه خميس عبد الجواد اللولو",
                "password"=> "38195",
                "phone"=> "599932643",
                "department_id"=> "19"
            ],
            [
                "id"=> "800056046",
                "name"=> "منى عيسى محمود النمس",
                "password"=> "223066",
                "phone"=> "599953640",
                "department_id"=> "23"
            ],
            [
                "id"=> "400528287",
                "name"=> "ريم عبدالهادي محمد عياد",
                "password"=> "0",
                "phone"=> "599984418",
                "department_id"=> "8"
            ],
            [
                "id"=> "971096052",
                "name"=> "محمود ابراهيم أحمد البلبيسي",
                "password"=> "45257",
                "phone"=> "599993269",
                "department_id"=> "8"
            ],
            [
                "id"=> "924395551",
                "name"=> "أحمد محمود محمد ابو ندى",
                "password"=> "23963",
                "phone"=> "31553",
                "department_id"=> "2"
            ],
            [
                "id"=> "900568908",
                "name"=> "ايمان عبد الرحمن محمد ابو شماله",
                "password"=> "37511",
                "phone"=> "33174",
                "department_id"=> "1"
            ],
            [
                "id"=> "930539267",
                "name"=> "بسام عبد العزيز عبد العزيز سبع العيش",
                "password"=> "46035",
                "phone"=> "48398",
                "department_id"=> "16"
            ],
            [
                "id"=> "926573932",
                "name"=> "جهان محمود حسن ابو جراد",
                "password"=> "40376",
                "phone"=> "68305",
                "department_id"=> "3"
            ],
            [
                "id"=> "903687440",
                "name"=> "جيهان زكي عطيه ابو هاشم",
                "password"=> "45449",
                "phone"=> "11071",
                "department_id"=> "10"
            ],
            [
                "id"=> "913681672",
                "name"=> "زهير موسى محمد الحبيبي",
                "password"=> "45872",
                "phone"=> "49623",
                "department_id"=> "16"
            ],
            [
                "id"=> "918485491",
                "name"=> "سعيد سلمان محمد برهوم",
                "password"=> "211527",
                "phone"=> "12726",
                "department_id"=> "16"
            ],
            [
                "id"=> "903105377",
                "name"=> "عايده سالم حمدان ضهير",
                "password"=> "45428",
                "phone"=> "55144",
                "department_id"=> "7"
            ],
            [
                "id"=> "900631078",
                "name"=> "عبد الحميد محمد لباد الأخرس",
                "password"=> "19794",
                "phone"=> "17140",
                "department_id"=> "22"
            ],
            [
                "id"=> "900849407",
                "name"=> "عزمي محمود علي منصور",
                "password"=> "45869",
                "phone"=> "53040",
                "department_id"=> "16"
            ],
            [
                "id"=> "802019661",
                "name"=> "محمد عادل خميس ابو حبيب",
                "password"=> "217653",
                "phone"=> "34142",
                "department_id"=> "4"
            ],
            [
                "id"=> "801922899",
                "name"=> "محمد عبد العزيز محمد ابو عرار",
                "password"=> "45871",
                "phone"=> "44908",
                "department_id"=> "16"
            ],
            [
                "id"=> "903691137",
                "name"=> "محمد محمد أحمد حرب",
                "password"=> "48638",
                "phone"=> "61281",
                "department_id"=> "4"
            ],
            [
                "id"=> "930353073",
                "name"=> "ناصر يوسف حسن حسنين",
                "password"=> "45956",
                "phone"=> "40800",
                "department_id"=> "16"
            ],
            // Add the remaining user data here...
        ];

        foreach ($users as $user) {
            User::create([
                'id' => $user['id'],
                'name' => $user['name'],
                'password' => $user['password'],
                'phone' => $user['phone'],
                'department_id' => $user['department_id'],
            ]);
        }
    }
}
